Revit 2027 API
PromptForFamilyInstancePlacementOptions Constructor
Overload List
Name | Description
PromptForFamilyInstancePlacementOptions() |  Creates a new PromptForFamilyInstancePlacementOptions using default options.
PromptForFamilyInstancePlacementOptions(PromptForFamilyInstancePlacementOptions) |  Creates a copy of an existing options object.
Top
See Also
Reference
PromptForFamilyInstancePlacementOptions Class
Autodesk.Revit.UI Namespace